OpenROAD 0b8b7ae255f8fbbbefa57d443949b84e73eed757 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/usb/runs/prueba18/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/usb/runs/prueba18/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/usb/runs/prueba18/tmp/routing/15-resizer_timing.def
[INFO ODB-0128] Design: usb
[INFO ODB-0130]     Created 46 pins.
[INFO ODB-0131]     Created 1501 components and 8780 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 5260 connections.
[INFO ODB-0133]     Created 1032 nets and 3520 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/usb/runs/prueba18/tmp/routing/15-resizer_timing.def
###############################################################################
# Created by write_sdc
# Fri Apr 21 23:56:55 2023
###############################################################################
current_design usb
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_48 -period 15.0000 [get_ports {clk_48}]
set_clock_transition 0.1500 [get_clocks {clk_48}]
set_clock_uncertainty 0.2500 clk_48
set_propagated_clock [get_clocks {clk_48}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[2]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[3]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[4]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[5]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[6]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[7]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in_valid}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_toggle}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {handshake[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {handshake[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {rst_n}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {rx_j}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {rx_se0}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[2]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[3]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[4]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[5]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[6]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[0]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[1]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[2]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[3]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[4]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[5]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[6]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[7]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_strobe}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {direction_in}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[0]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[1]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[2]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[3]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {setup}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {success}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {transaction_active}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {tx_en}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {tx_j}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {tx_se0}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_rst}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {data_strobe}]
set_load -pin_load 0.0334 [get_ports {direction_in}]
set_load -pin_load 0.0334 [get_ports {setup}]
set_load -pin_load 0.0334 [get_ports {success}]
set_load -pin_load 0.0334 [get_ports {transaction_active}]
set_load -pin_load 0.0334 [get_ports {tx_en}]
set_load -pin_load 0.0334 [get_ports {tx_j}]
set_load -pin_load 0.0334 [get_ports {tx_se0}]
set_load -pin_load 0.0334 [get_ports {usb_rst}]
set_load -pin_load 0.0334 [get_ports {data_out[7]}]
set_load -pin_load 0.0334 [get_ports {data_out[6]}]
set_load -pin_load 0.0334 [get_ports {data_out[5]}]
set_load -pin_load 0.0334 [get_ports {data_out[4]}]
set_load -pin_load 0.0334 [get_ports {data_out[3]}]
set_load -pin_load 0.0334 [get_ports {data_out[2]}]
set_load -pin_load 0.0334 [get_ports {data_out[1]}]
set_load -pin_load 0.0334 [get_ports {data_out[0]}]
set_load -pin_load 0.0334 [get_ports {endpoint[3]}]
set_load -pin_load 0.0334 [get_ports {endpoint[2]}]
set_load -pin_load 0.0334 [get_ports {endpoint[1]}]
set_load -pin_load 0.0334 [get_ports {endpoint[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_48}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_toggle}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_j}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_se0}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {handshake[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {handshake[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 6.0000 [current_design]
[INFO]: Setting signal min routing layer to: met1 and clock min routing layer to met1. 
[INFO]: Setting signal max routing layer to: met5 and clock max routing layer to met5. 
-congestion_iterations 50 -verbose
[INFO GRT-0020] Min routing layer: met1
[INFO GRT-0021] Max routing layer: met5
[INFO GRT-0022] Global adjustment: 30%
[INFO GRT-0023] Grid origin: (0, 0)
[INFO GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0088] Layer li1     Track-Pitch = 0.4600  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met1    Track-Pitch = 0.3400  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met2    Track-Pitch = 0.4600  line-2-Via Pitch: 0.3500
[INFO GRT-0088] Layer met3    Track-Pitch = 0.6800  line-2-Via Pitch: 0.6150
[INFO GRT-0088] Layer met4    Track-Pitch = 0.9200  line-2-Via Pitch: 1.0400
[INFO GRT-0088] Layer met5    Track-Pitch = 3.4000  line-2-Via Pitch: 3.1100
[INFO GRT-0019] Found 18 clock nets.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 20
[INFO GRT-0003] Macros: 0
[INFO GRT-0004] Blockages: 2799

[INFO GRT-0053] Routing resources analysis:
          Routing      Original      Derated      Resource
Layer     Direction    Resources     Resources    Reduction (%)
---------------------------------------------------------------
li1        Vertical            0             0          0.00%
met1       Horizontal      13000          7064          45.66%
met2       Vertical         9750          6458          33.76%
met3       Horizontal       6500          4608          29.11%
met4       Vertical         3900          2458          36.97%
met5       Horizontal       1300           648          50.15%
---------------------------------------------------------------

[INFO GRT-0197] Via related to pin nodes: 4665
[INFO GRT-0198] Via related Steiner nodes: 113
[INFO GRT-0199] Via filling finished.
[INFO GRT-0111] Final number of vias: 5239
[INFO GRT-0112] Final usage 3D: 19808

[INFO GRT-0096] Final congestion report:
Layer         Resource        Demand        Usage (%)    Max H / Max V / Total Overflow
---------------------------------------------------------------------------------------
li1                  0             0            0.00%             0 /  0 /  0
met1              7064          1995           28.24%             0 /  0 /  0
met2              6458          1972           30.54%             0 /  0 /  0
met3              4608            77            1.67%             0 /  0 /  0
met4              2458            47            1.91%             0 /  0 /  0
met5               648             0            0.00%             0 /  0 /  0
---------------------------------------------------------------------------------------
Total            21236          4091           19.26%             0 /  0 /  0

[INFO GRT-0018] Total wirelength: 46740 um
[INFO GRT-0006] Repairing antennas, iteration 1.
[INFO GRT-0043] No OR_DEFAULT vias defined.
Notice 0: disconnected net 418  _0371_
Notice 0: disconnected net 425  _0378_
Notice 0: disconnected net 486  _0439_
Notice 0: disconnected net 821  net48
Notice 0: disconnected net 824  net50
Notice 0: disconnected net 833  net59
[INFO GRT-0012] Antenna violations: 2
[INFO GRT-0015] 2 diodes inserted.
[INFO GRT-0009] rerouting 740 nets.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 20
[INFO GRT-0003] Macros: 0
[INFO GRT-0004] Blockages: 2799
[INFO GRT-0006] Repairing antennas, iteration 2.
[INFO GRT-0043] No OR_DEFAULT vias defined.
Notice 0: disconnected net 484  _0437_
Notice 0: disconnected net 821  net48
Notice 0: disconnected net 961  recv_queue_0\[5\]
[INFO GRT-0012] Antenna violations: 0
[INFO GRT-0014] Routed nets: 1032
[INFO]: Setting RC values...
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: _1601_ (rising edge-triggered flip-flop clocked by clk_48)
Endpoint: _1458_ (removal check against rising-edge clock clk_48)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.09    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.09    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.19    0.25 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00    0.25 ^ clkbuf_4_10_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.09    0.18    0.43 ^ clkbuf_4_10_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    16    0.04                           clknet_4_10_0_clk_48 (net)
                  0.09    0.00    0.43 ^ _1601_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.12    0.40    0.83 ^ _1601_/Q (sky130_fd_sc_hd__dfrtp_2)
     6    0.02                           tx.state[0] (net)
                  0.12    0.00    0.83 ^ _0870_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.20    0.21    1.05 ^ _0870_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     6    0.02                           _0400_ (net)
                  0.20    0.00    1.05 ^ _0930_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.12    0.20    1.24 ^ _0930_/X (sky130_fd_sc_hd__clkbuf_2)
     6    0.02                           _0452_ (net)
                  0.12    0.00    1.24 ^ _0932_/A2 (sky130_fd_sc_hd__o31a_2)
                  0.14    0.22    1.47 ^ _0932_/X (sky130_fd_sc_hd__o31a_2)
     5    0.03                           tx.tx_crc.rst_n (net)
                  0.14    0.00    1.47 ^ _1458_/SET_B (sky130_fd_sc_hd__dfstp_1)
                                  1.47   data arrival time

                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.09    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.09    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.21    0.27 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00    0.28 ^ clkbuf_4_2_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.08    0.19    0.47 ^ clkbuf_4_2_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    13    0.04                           clknet_4_2_0_clk_48 (net)
                  0.08    0.00    0.47 ^ _1458_/CLK (sky130_fd_sc_hd__dfstp_1)
                          0.25    0.72   clock uncertainty
                         -0.03    0.70   clock reconvergence pessimism
                          0.16    0.85   library removal time
                                  0.85   data required time
-----------------------------------------------------------------------------
                                  0.85   data required time
                                 -1.47   data arrival time
-----------------------------------------------------------------------------
                                  0.62   slack (MET)


Startpoint: _1595_ (rising edge-triggered flip-flop clocked by clk_48)
Endpoint: _1596_ (rising edge-triggered flip-flop clocked by clk_48)
Path Group: clk_48
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.09    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.09    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.19    0.25 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00    0.25 ^ clkbuf_4_3_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.06    0.16    0.41 ^ clkbuf_4_3_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
     8    0.02                           clknet_4_3_0_clk_48 (net)
                  0.06    0.00    0.41 ^ _1595_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.08    0.32    0.73 v _1595_/Q (sky130_fd_sc_hd__dfxtp_1)
     3    0.01                           recv.d_filter.r[0] (net)
                  0.08    0.00    0.73 v _1596_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.73   data arrival time

                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.09    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.09    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.21    0.27 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00    0.28 ^ clkbuf_4_3_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.06    0.17    0.45 ^ clkbuf_4_3_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
     8    0.02                           clknet_4_3_0_clk_48 (net)
                  0.06    0.00    0.45 ^ _1596_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.25    0.70   clock uncertainty
                         -0.04    0.66   clock reconvergence pessimism
                         -0.06    0.60   library hold time
                                  0.60   data required time
-----------------------------------------------------------------------------
                                  0.60   data required time
                                 -0.73   data arrival time
-----------------------------------------------------------------------------
                                  0.14   slack (MET)


min_report_end
REPORTE_ANA

===========================================================================
report_checks -path_delay FF MIN (Hold)
============================================================================
[WARNING STA-0322] instance 'sky130_fd_sc_hd__dfbbn_1' not found.
[WARNING STA-0322] instance 'sky130_fd_sc_hd__dfbbn_2' not found.
[WARNING STA-0322] instance 'sky130_fd_sc_hd__dfxtp_1' not found.
REPORTE_ANA_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
Startpoint: rst_n (input port clocked by clk_48)
Endpoint: _1449_ (recovery check against rising-edge clock clk_48)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          3.00    3.00 ^ input external delay
                  0.04    0.03    3.03 ^ rst_n (in)
     1    0.01                           rst_n (net)
                  0.04    0.00    3.03 ^ input13/A (sky130_fd_sc_hd__buf_6)
                  0.05    0.11    3.14 ^ input13/X (sky130_fd_sc_hd__buf_6)
     4    0.02                           net13 (net)
                  0.05    0.00    3.14 ^ repeater75/A (sky130_fd_sc_hd__clkbuf_2)
                  0.13    0.18    3.32 ^ repeater75/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net75 (net)
                  0.13    0.00    3.32 ^ repeater74/A (sky130_fd_sc_hd__clkbuf_2)
                  0.12    0.20    3.52 ^ repeater74/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net74 (net)
                  0.12    0.00    3.52 ^ repeater73/A (sky130_fd_sc_hd__clkbuf_1)
                  0.16    0.19    3.71 ^ repeater73/X (sky130_fd_sc_hd__clkbuf_1)
     3    0.01                           net73 (net)
                  0.16    0.00    3.71 ^ repeater72/A (sky130_fd_sc_hd__clkbuf_2)
                  0.13    0.21    3.92 ^ repeater72/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net72 (net)
                  0.13    0.00    3.92 ^ repeater71/A (sky130_fd_sc_hd__clkbuf_2)
                  0.13    0.20    4.12 ^ repeater71/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net71 (net)
                  0.13    0.00    4.12 ^ repeater70/A (sky130_fd_sc_hd__clkbuf_2)
                  0.14    0.21    4.33 ^ repeater70/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net70 (net)
                  0.14    0.00    4.33 ^ _0932_/B1 (sky130_fd_sc_hd__o31a_2)
                  0.15    0.26    4.59 ^ _0932_/X (sky130_fd_sc_hd__o31a_2)
     5    0.03                           tx.tx_crc.rst_n (net)
                  0.15    0.00    4.59 ^ repeater50/A (sky130_fd_sc_hd__clkbuf_2)
                  0.11    0.20    4.79 ^ repeater50/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net50 (net)
                  0.11    0.00    4.79 ^ repeater48/A (sky130_fd_sc_hd__clkbuf_2)
                  0.13    0.20    4.99 ^ repeater48/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net48 (net)
                  0.13    0.00    4.99 ^ _1449_/SET_B (sky130_fd_sc_hd__dfstp_1)
                                  4.99   data arrival time

                         15.00   15.00   clock clk_48 (rise edge)
                          0.00   15.00   clock source latency
                  0.09    0.06   15.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.09    0.00   15.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.19   15.25 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00   15.25 ^ clkbuf_4_0_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.10    0.19   15.44 ^ clkbuf_4_0_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    19    0.05                           clknet_4_0_0_clk_48 (net)
                  0.10    0.00   15.44 ^ _1449_/CLK (sky130_fd_sc_hd__dfstp_1)
                         -0.25   15.19   clock uncertainty
                          0.00   15.19   clock reconvergence pessimism
                          0.15   15.34   library recovery time
                                 15.34   data required time
-----------------------------------------------------------------------------
                                 15.34   data required time
                                 -4.99   data arrival time
-----------------------------------------------------------------------------
                                 10.35   slack (MET)


Startpoint: _1515_ (rising edge-triggered flip-flop clocked by clk_48)
Endpoint: usb_rst (output port clocked by clk_48)
Path Group: clk_48
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.09    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.09    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.21    0.27 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00    0.28 ^ clkbuf_4_15_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.10    0.21    0.48 ^ clkbuf_4_15_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    18    0.05                           clknet_4_15_0_clk_48 (net)
                  0.10    0.00    0.49 ^ _1515_/CLK (sky130_fd_sc_hd__dfrtp_1)
                  0.07    0.43    0.92 v _1515_/Q (sky130_fd_sc_hd__dfrtp_1)
     3    0.01                           recv.reset_detect.cntr[0] (net)
                  0.07    0.00    0.92 v _0905_/A (sky130_fd_sc_hd__nor4_2)
                  0.39    0.45    1.37 ^ _0905_/Y (sky130_fd_sc_hd__nor4_2)
     4    0.01                           _0431_ (net)
                  0.39    0.00    1.37 ^ _0909_/A (sky130_fd_sc_hd__nand4_1)
                  0.17    0.21    1.58 v _0909_/Y (sky130_fd_sc_hd__nand4_1)
     2    0.01                           _0435_ (net)
                  0.17    0.00    1.58 v _0911_/A (sky130_fd_sc_hd__nor2_2)
                  0.22    0.27    1.86 ^ _0911_/Y (sky130_fd_sc_hd__nor2_2)
     4    0.02                           _0437_ (net)
                  0.22    0.00    1.86 ^ _0914_/B (sky130_fd_sc_hd__nand4b_4)
                  0.13    0.17    2.03 v _0914_/Y (sky130_fd_sc_hd__nand4b_4)
     5    0.02                           _0440_ (net)
                  0.13    0.00    2.03 v _0915_/A (sky130_fd_sc_hd__inv_2)
                  0.05    0.09    2.12 ^ _0915_/Y (sky130_fd_sc_hd__inv_2)
     2    0.01                           net43 (net)
                  0.05    0.00    2.12 ^ output43/A (sky130_fd_sc_hd__buf_2)
                  0.18    0.22    2.34 ^ output43/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           usb_rst (net)
                  0.18    0.00    2.34 ^ usb_rst (out)
                                  2.34   data arrival time

                         15.00   15.00   clock clk_48 (rise edge)
                          0.00   15.00   clock network delay (propagated)
                         -0.25   14.75   clock uncertainty
                          0.00   14.75   clock reconvergence pessimism
                         -3.00   11.75   output external delay
                                 11.75   data required time
-----------------------------------------------------------------------------
                                 11.75   data required time
                                 -2.34   data arrival time
-----------------------------------------------------------------------------
                                  9.41   slack (MET)


max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: rst_n (input port clocked by clk_48)
Endpoint: _1449_ (recovery check against rising-edge clock clk_48)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          3.00    3.00 ^ input external delay
                  0.04    0.03    3.03 ^ rst_n (in)
     1    0.01                           rst_n (net)
                  0.04    0.00    3.03 ^ input13/A (sky130_fd_sc_hd__buf_6)
                  0.05    0.11    3.14 ^ input13/X (sky130_fd_sc_hd__buf_6)
     4    0.02                           net13 (net)
                  0.05    0.00    3.14 ^ repeater75/A (sky130_fd_sc_hd__clkbuf_2)
                  0.13    0.18    3.32 ^ repeater75/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net75 (net)
                  0.13    0.00    3.32 ^ repeater74/A (sky130_fd_sc_hd__clkbuf_2)
                  0.12    0.20    3.52 ^ repeater74/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net74 (net)
                  0.12    0.00    3.52 ^ repeater73/A (sky130_fd_sc_hd__clkbuf_1)
                  0.16    0.19    3.71 ^ repeater73/X (sky130_fd_sc_hd__clkbuf_1)
     3    0.01                           net73 (net)
                  0.16    0.00    3.71 ^ repeater72/A (sky130_fd_sc_hd__clkbuf_2)
                  0.13    0.21    3.92 ^ repeater72/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net72 (net)
                  0.13    0.00    3.92 ^ repeater71/A (sky130_fd_sc_hd__clkbuf_2)
                  0.13    0.20    4.12 ^ repeater71/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net71 (net)
                  0.13    0.00    4.12 ^ repeater70/A (sky130_fd_sc_hd__clkbuf_2)
                  0.14    0.21    4.33 ^ repeater70/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net70 (net)
                  0.14    0.00    4.33 ^ _0932_/B1 (sky130_fd_sc_hd__o31a_2)
                  0.15    0.26    4.59 ^ _0932_/X (sky130_fd_sc_hd__o31a_2)
     5    0.03                           tx.tx_crc.rst_n (net)
                  0.15    0.00    4.59 ^ repeater50/A (sky130_fd_sc_hd__clkbuf_2)
                  0.11    0.20    4.79 ^ repeater50/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net50 (net)
                  0.11    0.00    4.79 ^ repeater48/A (sky130_fd_sc_hd__clkbuf_2)
                  0.13    0.20    4.99 ^ repeater48/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net48 (net)
                  0.13    0.00    4.99 ^ _1449_/SET_B (sky130_fd_sc_hd__dfstp_1)
                                  4.99   data arrival time

                         15.00   15.00   clock clk_48 (rise edge)
                          0.00   15.00   clock source latency
                  0.09    0.06   15.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.09    0.00   15.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.19   15.25 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00   15.25 ^ clkbuf_4_0_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.10    0.19   15.44 ^ clkbuf_4_0_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    19    0.05                           clknet_4_0_0_clk_48 (net)
                  0.10    0.00   15.44 ^ _1449_/CLK (sky130_fd_sc_hd__dfstp_1)
                         -0.25   15.19   clock uncertainty
                          0.00   15.19   clock reconvergence pessimism
                          0.15   15.34   library recovery time
                                 15.34   data required time
-----------------------------------------------------------------------------
                                 15.34   data required time
                                 -4.99   data arrival time
-----------------------------------------------------------------------------
                                 10.35   slack (MET)


Startpoint: _1515_ (rising edge-triggered flip-flop clocked by clk_48)
Endpoint: usb_rst (output port clocked by clk_48)
Path Group: clk_48
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.09    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.09    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.21    0.27 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00    0.28 ^ clkbuf_4_15_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.10    0.21    0.48 ^ clkbuf_4_15_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    18    0.05                           clknet_4_15_0_clk_48 (net)
                  0.10    0.00    0.49 ^ _1515_/CLK (sky130_fd_sc_hd__dfrtp_1)
                  0.07    0.43    0.92 v _1515_/Q (sky130_fd_sc_hd__dfrtp_1)
     3    0.01                           recv.reset_detect.cntr[0] (net)
                  0.07    0.00    0.92 v _0905_/A (sky130_fd_sc_hd__nor4_2)
                  0.39    0.45    1.37 ^ _0905_/Y (sky130_fd_sc_hd__nor4_2)
     4    0.01                           _0431_ (net)
                  0.39    0.00    1.37 ^ _0909_/A (sky130_fd_sc_hd__nand4_1)
                  0.17    0.21    1.58 v _0909_/Y (sky130_fd_sc_hd__nand4_1)
     2    0.01                           _0435_ (net)
                  0.17    0.00    1.58 v _0911_/A (sky130_fd_sc_hd__nor2_2)
                  0.22    0.27    1.86 ^ _0911_/Y (sky130_fd_sc_hd__nor2_2)
     4    0.02                           _0437_ (net)
                  0.22    0.00    1.86 ^ _0914_/B (sky130_fd_sc_hd__nand4b_4)
                  0.13    0.17    2.03 v _0914_/Y (sky130_fd_sc_hd__nand4b_4)
     5    0.02                           _0440_ (net)
                  0.13    0.00    2.03 v _0915_/A (sky130_fd_sc_hd__inv_2)
                  0.05    0.09    2.12 ^ _0915_/Y (sky130_fd_sc_hd__inv_2)
     2    0.01                           net43 (net)
                  0.05    0.00    2.12 ^ output43/A (sky130_fd_sc_hd__buf_2)
                  0.18    0.22    2.34 ^ output43/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           usb_rst (net)
                  0.18    0.00    2.34 ^ usb_rst (out)
                                  2.34   data arrival time

                         15.00   15.00   clock clk_48 (rise edge)
                          0.00   15.00   clock network delay (propagated)
                         -0.25   14.75   clock uncertainty
                          0.00   14.75   clock reconvergence pessimism
                         -3.00   11.75   output external delay
                                 11.75   data required time
-----------------------------------------------------------------------------
                                 11.75   data required time
                                 -2.34   data arrival time
-----------------------------------------------------------------------------
                                  9.41   slack (MET)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================
max fanout

Pin                                   Limit Fanout  Slack
---------------------------------------------------------
clkbuf_4_0_0_clk_48/X                     6     19    -13 (VIOLATED)
clkbuf_4_15_0_clk_48/X                    6     18    -12 (VIOLATED)
clkbuf_4_5_0_clk_48/X                     6     17    -11 (VIOLATED)
clkbuf_0_clk_48/X                         6     16    -10 (VIOLATED)
clkbuf_4_10_0_clk_48/X                    6     16    -10 (VIOLATED)
clkbuf_4_2_0_clk_48/X                     6     13     -7 (VIOLATED)
clkbuf_4_13_0_clk_48/X                    6     12     -6 (VIOLATED)
clkbuf_4_14_0_clk_48/X                    6     12     -6 (VIOLATED)
clkbuf_4_1_0_clk_48/X                     6     12     -6 (VIOLATED)
clkbuf_4_4_0_clk_48/X                     6     12     -6 (VIOLATED)
clkbuf_4_7_0_clk_48/X                     6     12     -6 (VIOLATED)
clkbuf_4_8_0_clk_48/X                     6     11     -5 (VIOLATED)
clkbuf_4_11_0_clk_48/X                    6      9     -3 (VIOLATED)
clkbuf_4_6_0_clk_48/X                     6      9     -3 (VIOLATED)
clkbuf_4_12_0_clk_48/X                    6      8     -2 (VIOLATED)
clkbuf_4_3_0_clk_48/X                     6      8     -2 (VIOLATED)


===========================================================================
max slew violation count 0
max fanout violation count 16
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack 9.41

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack 0.14
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock clk_48
Latency      CRPR       Skew
_1477_/CLK ^
   0.49
_1434_/CLK ^
   0.40     -0.03       0.07

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             5.52e-04   2.59e-05   1.62e-09   5.78e-04  57.4%
Combinational          1.92e-04   2.37e-04   3.18e-09   4.29e-04  42.6%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  7.44e-04   2.63e-04   4.80e-09   1.01e-03 100.0%
                          73.9%      26.1%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 11657 u^2 44% utilization.
area_report_end
