OpenROAD 0b8b7ae255f8fbbbefa57d443949b84e73eed757 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/usb/runs/prueba7/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/usb/runs/prueba7/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/usb/runs/prueba7/tmp/cts/15-resizer_timing.def
[INFO ODB-0128] Design: usb
[INFO ODB-0130]     Created 46 pins.
[INFO ODB-0131]     Created 1501 components and 8780 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 5260 connections.
[INFO ODB-0133]     Created 1032 nets and 3520 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/usb/runs/prueba7/tmp/cts/15-resizer_timing.def
###############################################################################
# Created by write_sdc
# Fri Apr 21 23:09:56 2023
###############################################################################
current_design usb
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_48 -period 15.0000 [get_ports {clk_48}]
set_clock_transition 0.1500 [get_clocks {clk_48}]
set_clock_uncertainty 0.2500 clk_48
set_propagated_clock [get_clocks {clk_48}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[2]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[3]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[4]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[5]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[6]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[7]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in_valid}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_toggle}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {handshake[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {handshake[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {rst_n}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {rx_j}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {rx_se0}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[2]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[3]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[4]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[5]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[6]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[0]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[1]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[2]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[3]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[4]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[5]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[6]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[7]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_strobe}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {direction_in}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[0]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[1]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[2]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[3]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {setup}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {success}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {transaction_active}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {tx_en}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {tx_j}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {tx_se0}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_rst}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {data_strobe}]
set_load -pin_load 0.0334 [get_ports {direction_in}]
set_load -pin_load 0.0334 [get_ports {setup}]
set_load -pin_load 0.0334 [get_ports {success}]
set_load -pin_load 0.0334 [get_ports {transaction_active}]
set_load -pin_load 0.0334 [get_ports {tx_en}]
set_load -pin_load 0.0334 [get_ports {tx_j}]
set_load -pin_load 0.0334 [get_ports {tx_se0}]
set_load -pin_load 0.0334 [get_ports {usb_rst}]
set_load -pin_load 0.0334 [get_ports {data_out[7]}]
set_load -pin_load 0.0334 [get_ports {data_out[6]}]
set_load -pin_load 0.0334 [get_ports {data_out[5]}]
set_load -pin_load 0.0334 [get_ports {data_out[4]}]
set_load -pin_load 0.0334 [get_ports {data_out[3]}]
set_load -pin_load 0.0334 [get_ports {data_out[2]}]
set_load -pin_load 0.0334 [get_ports {data_out[1]}]
set_load -pin_load 0.0334 [get_ports {data_out[0]}]
set_load -pin_load 0.0334 [get_ports {endpoint[3]}]
set_load -pin_load 0.0334 [get_ports {endpoint[2]}]
set_load -pin_load 0.0334 [get_ports {endpoint[1]}]
set_load -pin_load 0.0334 [get_ports {endpoint[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_48}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_toggle}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_j}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_se0}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {handshake[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {handshake[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 6.0000 [current_design]
[INFO]: Setting signal min routing layer to: met1 and clock min routing layer to met1. 
[INFO]: Setting signal max routing layer to: met5 and clock max routing layer to met5. 
-congestion_iterations 50 -verbose
[INFO GRT-0020] Min routing layer: met1
[INFO GRT-0021] Max routing layer: met5
[INFO GRT-0022] Global adjustment: 30%
[INFO GRT-0023] Grid origin: (0, 0)
[INFO GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0088] Layer li1     Track-Pitch = 0.4600  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met1    Track-Pitch = 0.3400  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met2    Track-Pitch = 0.4600  line-2-Via Pitch: 0.3500
[INFO GRT-0088] Layer met3    Track-Pitch = 0.6800  line-2-Via Pitch: 0.6150
[INFO GRT-0088] Layer met4    Track-Pitch = 0.9200  line-2-Via Pitch: 1.0400
[INFO GRT-0088] Layer met5    Track-Pitch = 3.4000  line-2-Via Pitch: 3.1100
[INFO GRT-0019] Found 18 clock nets.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 20
[INFO GRT-0003] Macros: 0
[INFO GRT-0004] Blockages: 2799

[INFO GRT-0053] Routing resources analysis:
          Routing      Original      Derated      Resource
Layer     Direction    Resources     Resources    Reduction (%)
---------------------------------------------------------------
li1        Vertical            0             0          0.00%
met1       Horizontal      13000          7064          45.66%
met2       Vertical         9750          6458          33.76%
met3       Horizontal       6500          4608          29.11%
met4       Vertical         3900          2458          36.97%
met5       Horizontal       1300           648          50.15%
---------------------------------------------------------------

[INFO GRT-0197] Via related to pin nodes: 4665
[INFO GRT-0198] Via related Steiner nodes: 113
[INFO GRT-0199] Via filling finished.
[INFO GRT-0111] Final number of vias: 5239
[INFO GRT-0112] Final usage 3D: 19808

[INFO GRT-0096] Final congestion report:
Layer         Resource        Demand        Usage (%)    Max H / Max V / Total Overflow
---------------------------------------------------------------------------------------
li1                  0             0            0.00%             0 /  0 /  0
met1              7064          1995           28.24%             0 /  0 /  0
met2              6458          1972           30.54%             0 /  0 /  0
met3              4608            77            1.67%             0 /  0 /  0
met4              2458            47            1.91%             0 /  0 /  0
met5               648             0            0.00%             0 /  0 /  0
---------------------------------------------------------------------------------------
Total            21236          4091           19.26%             0 /  0 /  0

[INFO GRT-0018] Total wirelength: 46740 um
[INFO]: Setting RC values...
[INFO RSZ-0033] No hold violations found.
Placement Analysis
---------------------------------
total displacement          0.0 u
average displacement        0.0 u
max displacement            0.0 u
original HPWL           25471.6 u
legalized HPWL          26152.9 u
delta HPWL                    3 %

[INFO DPL-0020] Mirrored 377 instances
[INFO DPL-0021] HPWL before           26152.9 u
[INFO DPL-0022] HPWL after            25471.6 u
[INFO DPL-0023] HPWL delta               -2.6 %
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: _1601_ (rising edge-triggered flip-flop clocked by clk_48)
Endpoint: _1458_ (removal check against rising-edge clock clk_48)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.09    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.09    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.19    0.25 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00    0.25 ^ clkbuf_4_10_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.09    0.18    0.42 ^ clkbuf_4_10_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    16    0.04                           clknet_4_10_0_clk_48 (net)
                  0.09    0.00    0.43 ^ _1601_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.12    0.40    0.83 ^ _1601_/Q (sky130_fd_sc_hd__dfrtp_2)
     6    0.02                           tx.state[0] (net)
                  0.12    0.00    0.83 ^ _0870_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.20    0.21    1.04 ^ _0870_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     6    0.02                           _0400_ (net)
                  0.20    0.00    1.04 ^ _0930_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.12    0.20    1.24 ^ _0930_/X (sky130_fd_sc_hd__clkbuf_2)
     6    0.02                           _0452_ (net)
                  0.12    0.00    1.24 ^ _0932_/A2 (sky130_fd_sc_hd__o31a_2)
                  0.14    0.22    1.46 ^ _0932_/X (sky130_fd_sc_hd__o31a_2)
     5    0.03                           tx.tx_crc.rst_n (net)
                  0.14    0.00    1.47 ^ _1458_/SET_B (sky130_fd_sc_hd__dfstp_1)
                                  1.47   data arrival time

                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.09    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.09    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.21    0.27 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00    0.27 ^ clkbuf_4_2_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.08    0.19    0.46 ^ clkbuf_4_2_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    13    0.04                           clknet_4_2_0_clk_48 (net)
                  0.08    0.00    0.47 ^ _1458_/CLK (sky130_fd_sc_hd__dfstp_1)
                          0.25    0.72   clock uncertainty
                         -0.03    0.69   clock reconvergence pessimism
                          0.16    0.85   library removal time
                                  0.85   data required time
-----------------------------------------------------------------------------
                                  0.85   data required time
                                 -1.47   data arrival time
-----------------------------------------------------------------------------
                                  0.62   slack (MET)


Startpoint: _1595_ (rising edge-triggered flip-flop clocked by clk_48)
Endpoint: _1596_ (rising edge-triggered flip-flop clocked by clk_48)
Path Group: clk_48
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.09    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.09    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.19    0.25 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00    0.25 ^ clkbuf_4_3_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.06    0.16    0.40 ^ clkbuf_4_3_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
     8    0.02                           clknet_4_3_0_clk_48 (net)
                  0.06    0.00    0.40 ^ _1595_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.07    0.32    0.73 v _1595_/Q (sky130_fd_sc_hd__dfxtp_1)
     3    0.01                           recv.d_filter.r[0] (net)
                  0.07    0.00    0.73 v _1596_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.73   data arrival time

                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.09    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.09    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.21    0.27 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00    0.27 ^ clkbuf_4_3_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.06    0.17    0.45 ^ clkbuf_4_3_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
     8    0.02                           clknet_4_3_0_clk_48 (net)
                  0.06    0.00    0.45 ^ _1596_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.25    0.70   clock uncertainty
                         -0.04    0.65   clock reconvergence pessimism
                         -0.06    0.59   library hold time
                                  0.59   data required time
-----------------------------------------------------------------------------
                                  0.59   data required time
                                 -0.73   data arrival time
-----------------------------------------------------------------------------
                                  0.13   slack (MET)


min_report_end
Error: sta.tcl, 73 couldn't open "/home/licit/OpenLane/tipos_ff.txt": no such file or directory
