OpenROAD 0b8b7ae255f8fbbbefa57d443949b84e73eed757 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/usb/runs/prueba7/tmp/merged.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/usb/runs/prueba7/tmp/merged.nom.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/usb/runs/prueba7/results/routing/usb.def
[INFO ODB-0128] Design: usb
[INFO ODB-0130]     Created 46 pins.
[INFO ODB-0131]     Created 3559 components and 17014 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 13492 connections.
[INFO ODB-0133]     Created 1032 nets and 3522 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/usb/runs/prueba7/results/routing/usb.def
###############################################################################
# Created by write_sdc
# Fri Apr 21 23:09:57 2023
###############################################################################
current_design usb
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_48 -period 15.0000 [get_ports {clk_48}]
set_clock_transition 0.1500 [get_clocks {clk_48}]
set_clock_uncertainty 0.2500 clk_48
set_propagated_clock [get_clocks {clk_48}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[2]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[3]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[4]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[5]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[6]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[7]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in_valid}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_toggle}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {handshake[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {handshake[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {rst_n}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {rx_j}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {rx_se0}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[2]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[3]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[4]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[5]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[6]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[0]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[1]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[2]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[3]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[4]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[5]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[6]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[7]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_strobe}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {direction_in}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[0]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[1]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[2]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[3]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {setup}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {success}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {transaction_active}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {tx_en}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {tx_j}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {tx_se0}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_rst}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {data_strobe}]
set_load -pin_load 0.0334 [get_ports {direction_in}]
set_load -pin_load 0.0334 [get_ports {setup}]
set_load -pin_load 0.0334 [get_ports {success}]
set_load -pin_load 0.0334 [get_ports {transaction_active}]
set_load -pin_load 0.0334 [get_ports {tx_en}]
set_load -pin_load 0.0334 [get_ports {tx_j}]
set_load -pin_load 0.0334 [get_ports {tx_se0}]
set_load -pin_load 0.0334 [get_ports {usb_rst}]
set_load -pin_load 0.0334 [get_ports {data_out[7]}]
set_load -pin_load 0.0334 [get_ports {data_out[6]}]
set_load -pin_load 0.0334 [get_ports {data_out[5]}]
set_load -pin_load 0.0334 [get_ports {data_out[4]}]
set_load -pin_load 0.0334 [get_ports {data_out[3]}]
set_load -pin_load 0.0334 [get_ports {data_out[2]}]
set_load -pin_load 0.0334 [get_ports {data_out[1]}]
set_load -pin_load 0.0334 [get_ports {data_out[0]}]
set_load -pin_load 0.0334 [get_ports {endpoint[3]}]
set_load -pin_load 0.0334 [get_ports {endpoint[2]}]
set_load -pin_load 0.0334 [get_ports {endpoint[1]}]
set_load -pin_load 0.0334 [get_ports {endpoint[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_48}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_toggle}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_j}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_se0}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {handshake[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {handshake[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 6.0000 [current_design]
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: _1601_ (rising edge-triggered flip-flop clocked by clk_48)
Endpoint: _1458_ (removal check against rising-edge clock clk_48)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.08    0.05    0.05 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.08    0.00    0.05 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19    0.24 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.11    0.00    0.24 ^ clkbuf_4_10_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.08    0.17    0.42 ^ clkbuf_4_10_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    16    0.04                           clknet_4_10_0_clk_48 (net)
                  0.08    0.00    0.42 ^ _1601_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.12    0.40    0.82 ^ _1601_/Q (sky130_fd_sc_hd__dfrtp_2)
     6    0.02                           tx.state[0] (net)
                  0.12    0.00    0.82 ^ _0870_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.19    0.21    1.03 ^ _0870_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     6    0.02                           _0400_ (net)
                  0.19    0.00    1.03 ^ _0930_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.12    0.19    1.22 ^ _0930_/X (sky130_fd_sc_hd__clkbuf_2)
     6    0.02                           _0452_ (net)
                  0.12    0.00    1.22 ^ _0932_/A2 (sky130_fd_sc_hd__o31a_2)
                  0.14    0.22    1.44 ^ _0932_/X (sky130_fd_sc_hd__o31a_2)
     5    0.02                           tx.tx_crc.rst_n (net)
                  0.14    0.00    1.44 ^ _1458_/SET_B (sky130_fd_sc_hd__dfstp_1)
                                  1.44   data arrival time

                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.08    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.08    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.21    0.27 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.01    0.27 ^ clkbuf_4_2_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.08    0.19    0.46 ^ clkbuf_4_2_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    13    0.04                           clknet_4_2_0_clk_48 (net)
                  0.08    0.00    0.46 ^ _1458_/CLK (sky130_fd_sc_hd__dfstp_1)
                          0.25    0.71   clock uncertainty
                         -0.03    0.69   clock reconvergence pessimism
                          0.15    0.84   library removal time
                                  0.84   data required time
-----------------------------------------------------------------------------
                                  0.84   data required time
                                 -1.44   data arrival time
-----------------------------------------------------------------------------
                                  0.60   slack (MET)


Startpoint: _1595_ (rising edge-triggered flip-flop clocked by clk_48)
Endpoint: _1596_ (rising edge-triggered flip-flop clocked by clk_48)
Path Group: clk_48
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.08    0.05    0.05 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.08    0.00    0.05 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19    0.24 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.01    0.25 ^ clkbuf_4_3_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.05    0.15    0.40 ^ clkbuf_4_3_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
     8    0.02                           clknet_4_3_0_clk_48 (net)
                  0.05    0.00    0.40 ^ _1595_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.07    0.32    0.72 v _1595_/Q (sky130_fd_sc_hd__dfxtp_1)
     3    0.01                           recv.d_filter.r[0] (net)
                  0.07    0.00    0.72 v _1596_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.72   data arrival time

                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.08    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.08    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.21    0.27 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.01    0.27 ^ clkbuf_4_3_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.05    0.17    0.44 ^ clkbuf_4_3_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
     8    0.02                           clknet_4_3_0_clk_48 (net)
                  0.05    0.00    0.44 ^ _1596_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.25    0.69   clock uncertainty
                         -0.04    0.65   clock reconvergence pessimism
                         -0.06    0.59   library hold time
                                  0.59   data required time
-----------------------------------------------------------------------------
                                  0.59   data required time
                                 -0.72   data arrival time
-----------------------------------------------------------------------------
                                  0.13   slack (MET)


min_report_end
Error: sta.tcl, 73 couldn't open "/home/licit/OpenLane/tipos_ff.txt": no such file or directory
