OpenROAD 0b8b7ae255f8fbbbefa57d443949b84e73eed757 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/usb/runs/prueba18/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/usb/runs/prueba18/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/usb/runs/prueba18/results/placement/usb.def
[INFO ODB-0128] Design: usb
[INFO ODB-0130]     Created 46 pins.
[INFO ODB-0131]     Created 1481 components and 8660 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 5180 connections.
[INFO ODB-0133]     Created 1012 nets and 3480 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/usb/runs/prueba18/results/placement/usb.def
###############################################################################
# Created by write_sdc
# Fri Apr 21 23:56:21 2023
###############################################################################
current_design usb
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_48 -period 15.0000 [get_ports {clk_48}]
set_clock_transition 0.1500 [get_clocks {clk_48}]
set_clock_uncertainty 0.2500 clk_48
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[2]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[3]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[4]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[5]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[6]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[7]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in_valid}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_toggle}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {handshake[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {handshake[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {rst_n}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {rx_j}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {rx_se0}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[2]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[3]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[4]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[5]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[6]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[0]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[1]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[2]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[3]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[4]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[5]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[6]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[7]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_strobe}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {direction_in}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[0]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[1]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[2]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[3]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {setup}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {success}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {transaction_active}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {tx_en}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {tx_j}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {tx_se0}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_rst}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {data_strobe}]
set_load -pin_load 0.0334 [get_ports {direction_in}]
set_load -pin_load 0.0334 [get_ports {setup}]
set_load -pin_load 0.0334 [get_ports {success}]
set_load -pin_load 0.0334 [get_ports {transaction_active}]
set_load -pin_load 0.0334 [get_ports {tx_en}]
set_load -pin_load 0.0334 [get_ports {tx_j}]
set_load -pin_load 0.0334 [get_ports {tx_se0}]
set_load -pin_load 0.0334 [get_ports {usb_rst}]
set_load -pin_load 0.0334 [get_ports {data_out[7]}]
set_load -pin_load 0.0334 [get_ports {data_out[6]}]
set_load -pin_load 0.0334 [get_ports {data_out[5]}]
set_load -pin_load 0.0334 [get_ports {data_out[4]}]
set_load -pin_load 0.0334 [get_ports {data_out[3]}]
set_load -pin_load 0.0334 [get_ports {data_out[2]}]
set_load -pin_load 0.0334 [get_ports {data_out[1]}]
set_load -pin_load 0.0334 [get_ports {data_out[0]}]
set_load -pin_load 0.0334 [get_ports {endpoint[3]}]
set_load -pin_load 0.0334 [get_ports {endpoint[2]}]
set_load -pin_load 0.0334 [get_ports {endpoint[1]}]
set_load -pin_load 0.0334 [get_ports {endpoint[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_48}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_toggle}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_j}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_se0}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {handshake[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {handshake[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 6.0000 [current_design]
[INFO]: Setting RC values...
[INFO]: Configuring cts characterization...
[INFO]: Performing clock tree synthesis...
[INFO]: Looking for the following net(s): clk_48
[INFO]: Running Clock Tree Synthesis...
[INFO CTS-0049] Characterization buffer is: sky130_fd_sc_hd__clkbuf_8.
[INFO CTS-0038] Number of created patterns = 50000.
[INFO CTS-0038] Number of created patterns = 100000.
[INFO CTS-0039] Number of created patterns = 137808.
[INFO CTS-0084] Compiling LUT.
Min. len    Max. len    Min. cap    Max. cap    Min. slew   Max. slew
2           8           1           35          1           48          
[WARNING CTS-0043] 4752 wires are pure wire and no slew degradation.
TritonCTS forced slew degradation on these wires.
[INFO CTS-0046]     Number of wire segments: 137808.
[INFO CTS-0047]     Number of keys in characterization LUT: 1760.
[INFO CTS-0048]     Actual min input cap: 1.
[INFO CTS-0007] Net "clk_48" found for clock "clk_48".
[INFO CTS-0010]  Clock net "clk_48" has 194 sinks.
[INFO CTS-0008] TritonCTS found 1 clock nets.
[INFO CTS-0097] Characterization used 2 buffer(s) types.
[INFO CTS-0027] Generating H-Tree topology for net clk_48.
[INFO CTS-0028]  Total number of sinks: 194.
[INFO CTS-0029]  Sinks will be clustered in groups of up to 25 and with maximum cluster diameter of 50.0 um.
[INFO CTS-0030]  Number of static layers: 0.
[INFO CTS-0020]  Wire segment unit: 13000  dbu (13 um).
[INFO CTS-0023]  Original sink region: [(7625, 15020), (163495, 167340)].
[INFO CTS-0024]  Normalized sink region: [(0.586538, 1.15538), (12.5765, 12.8723)].
[INFO CTS-0025]     Width:  11.9900.
[INFO CTS-0026]     Height: 11.7169.
 Level 1
    Direction: Horizontal
    Sinks per sub-region: 97
    Sub-region size: 5.9950 X 11.7169
[INFO CTS-0034]     Segment length (rounded): 2.
    Key: 0 outSlew: 2 load: 1 length: 2 isBuffered: false
 Level 2
    Direction: Vertical
    Sinks per sub-region: 49
    Sub-region size: 5.9950 X 5.8585
[INFO CTS-0034]     Segment length (rounded): 2.
    Key: 0 outSlew: 2 load: 1 length: 2 isBuffered: false
[WARNING CTS-0045] Creating fake entries in the LUT.
 Level 3
    Direction: Horizontal
    Sinks per sub-region: 25
    Sub-region size: 2.9975 X 5.8585
[INFO CTS-0034]     Segment length (rounded): 1.
    Key: 137811 outSlew: 3 load: 1 length: 1 isBuffered: false
 Out of 52 sinks, 1 sinks closer to other cluster.
 Out of 50 sinks, 1 sinks closer to other cluster.
 Level 4
    Direction: Vertical
    Sinks per sub-region: 13
    Sub-region size: 2.9975 X 2.9292
[INFO CTS-0034]     Segment length (rounded): 1.
    Key: 137969 outSlew: 6 load: 1 length: 1 isBuffered: true
 Out of 31 sinks, 2 sinks closer to other cluster.
 Out of 21 sinks, 1 sinks closer to other cluster.
 Out of 29 sinks, 3 sinks closer to other cluster.
 Out of 21 sinks, 2 sinks closer to other cluster.
 Out of 20 sinks, 1 sinks closer to other cluster.
 Out of 30 sinks, 2 sinks closer to other cluster.
[INFO CTS-0032]  Stop criterion found. Max number of sinks is 15.
[INFO CTS-0035]  Number of sinks covered: 194.
[INFO CTS-0036]  Average source sink dist: 29820.07 dbu.
[INFO CTS-0037]  Number of outlier sinks: 0.
[INFO CTS-0018]     Created 17 clock buffers.
[INFO CTS-0012]     Minimum number of buffers in the clock path: 2.
[INFO CTS-0013]     Maximum number of buffers in the clock path: 2.
[INFO CTS-0015]     Created 17 clock nets.
[INFO CTS-0016]     Fanout distribution for the current clock = 6:1, 8:2, 9:2, 11:1, 12:5, 13:1, 16:1, 17:1, 18:1, 19:1..
[INFO CTS-0017]     Max level of the clock tree: 4.
[INFO CTS-0098] Clock net "clk_48"
[INFO CTS-0099]  Sinks 194
[INFO CTS-0100]  Leaf buffers 0
[INFO CTS-0101]  Average sink wire length 208.59 um
[INFO CTS-0102]  Path depth 2 - 2
[INFO]: Repairing long wires on clock nets...
[INFO RSZ-0058] Using max wire length 3048um.
[INFO]: Legalizing...
Placement Analysis
---------------------------------
total displacement        111.2 u
average displacement        0.1 u
max displacement            6.9 u
original HPWL           25227.7 u
legalized HPWL          25950.9 u
delta HPWL                    3 %

[INFO DPL-0020] Mirrored 377 instances
[INFO DPL-0021] HPWL before           25950.9 u
[INFO DPL-0022] HPWL after            25265.7 u
[INFO DPL-0023] HPWL delta               -2.6 %
cts_report
[INFO CTS-0003] Total number of Clock Roots: 1.
[INFO CTS-0004] Total number of Buffers Inserted: 17.
[INFO CTS-0005] Total number of Clock Subnets: 17.
[INFO CTS-0006] Total number of Sinks: 194.
cts_report_end
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: _1601_ (rising edge-triggered flip-flop clocked by clk_48)
Endpoint: _1458_ (removal check against rising-edge clock clk_48)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.08    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.08    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.19    0.25 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00    0.25 ^ clkbuf_4_10_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.09    0.18    0.43 ^ clkbuf_4_10_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    16    0.04                           clknet_4_10_0_clk_48 (net)
                  0.09    0.00    0.43 ^ _1601_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.12    0.40    0.83 ^ _1601_/Q (sky130_fd_sc_hd__dfrtp_2)
     6    0.02                           tx.state[0] (net)
                  0.12    0.00    0.83 ^ _0870_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.19    0.20    1.03 ^ _0870_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     6    0.02                           _0400_ (net)
                  0.19    0.00    1.03 ^ _0930_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.11    0.19    1.22 ^ _0930_/X (sky130_fd_sc_hd__clkbuf_2)
     6    0.02                           _0452_ (net)
                  0.11    0.00    1.22 ^ _0932_/A2 (sky130_fd_sc_hd__o31a_2)
                  0.14    0.22    1.44 ^ _0932_/X (sky130_fd_sc_hd__o31a_2)
     5    0.02                           tx.tx_crc.rst_n (net)
                  0.14    0.00    1.44 ^ _1458_/SET_B (sky130_fd_sc_hd__dfstp_1)
                                  1.44   data arrival time

                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.08    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.08    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.21    0.27 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00    0.27 ^ clkbuf_4_2_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.08    0.19    0.46 ^ clkbuf_4_2_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    13    0.04                           clknet_4_2_0_clk_48 (net)
                  0.08    0.00    0.46 ^ _1458_/CLK (sky130_fd_sc_hd__dfstp_1)
                          0.25    0.71   clock uncertainty
                         -0.03    0.69   clock reconvergence pessimism
                          0.15    0.84   library removal time
                                  0.84   data required time
-----------------------------------------------------------------------------
                                  0.84   data required time
                                 -1.44   data arrival time
-----------------------------------------------------------------------------
                                  0.60   slack (MET)


Startpoint: _1591_ (rising edge-triggered flip-flop clocked by clk_48)
Endpoint: _1592_ (rising edge-triggered flip-flop clocked by clk_48)
Path Group: clk_48
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.08    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.08    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.19    0.25 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00    0.25 ^ clkbuf_4_14_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.07    0.17    0.41 ^ clkbuf_4_14_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    12    0.03                           clknet_4_14_0_clk_48 (net)
                  0.07    0.00    0.41 ^ _1591_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.07    0.32    0.74 v _1591_/Q (sky130_fd_sc_hd__dfxtp_1)
     4    0.01                           recv.se0_filter.r[1] (net)
                  0.07    0.00    0.74 v _1592_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.74   data arrival time

                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.08    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.08    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.21    0.27 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00    0.27 ^ clkbuf_4_15_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.10    0.20    0.48 ^ clkbuf_4_15_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    18    0.05                           clknet_4_15_0_clk_48 (net)
                  0.10    0.00    0.48 ^ _1592_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.25    0.73   clock uncertainty
                         -0.03    0.70   clock reconvergence pessimism
                         -0.05    0.65   library hold time
                                  0.65   data required time
-----------------------------------------------------------------------------
                                  0.65   data required time
                                 -0.74   data arrival time
-----------------------------------------------------------------------------
                                  0.09   slack (MET)


min_report_end
REPORTE_ANA

===========================================================================
report_checks -path_delay FF MIN (Hold)
============================================================================
[WARNING STA-0322] instance 'sky130_fd_sc_hd__dfbbn_1' not found.
[WARNING STA-0322] instance 'sky130_fd_sc_hd__dfbbn_2' not found.
[WARNING STA-0322] instance 'sky130_fd_sc_hd__dfxtp_1' not found.
REPORTE_ANA_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
Startpoint: rst_n (input port clocked by clk_48)
Endpoint: _1449_ (recovery check against rising-edge clock clk_48)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          3.00    3.00 ^ input external delay
                  0.03    0.02    3.02 ^ rst_n (in)
     1    0.01                           rst_n (net)
                  0.03    0.00    3.02 ^ input13/A (sky130_fd_sc_hd__buf_6)
                  0.05    0.11    3.13 ^ input13/X (sky130_fd_sc_hd__buf_6)
     4    0.02                           net13 (net)
                  0.05    0.00    3.13 ^ repeater75/A (sky130_fd_sc_hd__clkbuf_2)
                  0.13    0.17    3.30 ^ repeater75/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net75 (net)
                  0.13    0.00    3.30 ^ repeater74/A (sky130_fd_sc_hd__clkbuf_2)
                  0.11    0.19    3.49 ^ repeater74/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net74 (net)
                  0.11    0.00    3.49 ^ repeater73/A (sky130_fd_sc_hd__clkbuf_1)
                  0.15    0.18    3.67 ^ repeater73/X (sky130_fd_sc_hd__clkbuf_1)
     3    0.01                           net73 (net)
                  0.15    0.00    3.67 ^ repeater72/A (sky130_fd_sc_hd__clkbuf_2)
                  0.12    0.21    3.88 ^ repeater72/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net72 (net)
                  0.12    0.00    3.88 ^ repeater71/A (sky130_fd_sc_hd__clkbuf_2)
                  0.12    0.20    4.07 ^ repeater71/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net71 (net)
                  0.12    0.00    4.07 ^ repeater70/A (sky130_fd_sc_hd__clkbuf_2)
                  0.13    0.20    4.28 ^ repeater70/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net70 (net)
                  0.13    0.00    4.28 ^ _0932_/B1 (sky130_fd_sc_hd__o31a_2)
                  0.14    0.25    4.53 ^ _0932_/X (sky130_fd_sc_hd__o31a_2)
     5    0.02                           tx.tx_crc.rst_n (net)
                  0.14    0.00    4.53 ^ repeater50/A (sky130_fd_sc_hd__clkbuf_2)
                  0.11    0.19    4.72 ^ repeater50/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net50 (net)
                  0.11    0.00    4.72 ^ repeater48/A (sky130_fd_sc_hd__clkbuf_2)
                  0.12    0.19    4.91 ^ repeater48/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net48 (net)
                  0.12    0.00    4.91 ^ _1449_/SET_B (sky130_fd_sc_hd__dfstp_1)
                                  4.91   data arrival time

                         15.00   15.00   clock clk_48 (rise edge)
                          0.00   15.00   clock source latency
                  0.08    0.06   15.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.08    0.00   15.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.19   15.25 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00   15.25 ^ clkbuf_4_0_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.10    0.19   15.43 ^ clkbuf_4_0_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    19    0.05                           clknet_4_0_0_clk_48 (net)
                  0.10    0.00   15.44 ^ _1449_/CLK (sky130_fd_sc_hd__dfstp_1)
                         -0.25   15.19   clock uncertainty
                          0.00   15.19   clock reconvergence pessimism
                          0.15   15.33   library recovery time
                                 15.33   data required time
-----------------------------------------------------------------------------
                                 15.33   data required time
                                 -4.91   data arrival time
-----------------------------------------------------------------------------
                                 10.42   slack (MET)


Startpoint: _1515_ (rising edge-triggered flip-flop clocked by clk_48)
Endpoint: usb_rst (output port clocked by clk_48)
Path Group: clk_48
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.08    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.08    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.21    0.27 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00    0.27 ^ clkbuf_4_15_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.10    0.20    0.48 ^ clkbuf_4_15_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    18    0.05                           clknet_4_15_0_clk_48 (net)
                  0.10    0.00    0.48 ^ _1515_/CLK (sky130_fd_sc_hd__dfrtp_1)
                  0.07    0.43    0.91 v _1515_/Q (sky130_fd_sc_hd__dfrtp_1)
     3    0.01                           recv.reset_detect.cntr[0] (net)
                  0.07    0.00    0.91 v _0905_/A (sky130_fd_sc_hd__nor4_2)
                  0.37    0.43    1.34 ^ _0905_/Y (sky130_fd_sc_hd__nor4_2)
     4    0.01                           _0431_ (net)
                  0.37    0.00    1.34 ^ _0909_/A (sky130_fd_sc_hd__nand4_1)
                  0.15    0.19    1.52 v _0909_/Y (sky130_fd_sc_hd__nand4_1)
     2    0.01                           _0435_ (net)
                  0.15    0.00    1.52 v _0911_/A (sky130_fd_sc_hd__nor2_2)
                  0.21    0.26    1.78 ^ _0911_/Y (sky130_fd_sc_hd__nor2_2)
     4    0.02                           _0437_ (net)
                  0.21    0.00    1.79 ^ _0914_/B (sky130_fd_sc_hd__nand4b_4)
                  0.12    0.17    1.95 v _0914_/Y (sky130_fd_sc_hd__nand4b_4)
     5    0.02                           _0440_ (net)
                  0.12    0.00    1.95 v _0915_/A (sky130_fd_sc_hd__inv_2)
                  0.05    0.09    2.04 ^ _0915_/Y (sky130_fd_sc_hd__inv_2)
     2    0.01                           net43 (net)
                  0.05    0.00    2.04 ^ output43/A (sky130_fd_sc_hd__buf_2)
                  0.17    0.21    2.25 ^ output43/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           usb_rst (net)
                  0.17    0.00    2.25 ^ usb_rst (out)
                                  2.25   data arrival time

                         15.00   15.00   clock clk_48 (rise edge)
                          0.00   15.00   clock network delay (propagated)
                         -0.25   14.75   clock uncertainty
                          0.00   14.75   clock reconvergence pessimism
                         -3.00   11.75   output external delay
                                 11.75   data required time
-----------------------------------------------------------------------------
                                 11.75   data required time
                                 -2.25   data arrival time
-----------------------------------------------------------------------------
                                  9.50   slack (MET)


max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: rst_n (input port clocked by clk_48)
Endpoint: _1449_ (recovery check against rising-edge clock clk_48)
Path Group: **async_default**
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          3.00    3.00 ^ input external delay
                  0.03    0.02    3.02 ^ rst_n (in)
     1    0.01                           rst_n (net)
                  0.03    0.00    3.02 ^ input13/A (sky130_fd_sc_hd__buf_6)
                  0.05    0.11    3.13 ^ input13/X (sky130_fd_sc_hd__buf_6)
     4    0.02                           net13 (net)
                  0.05    0.00    3.13 ^ repeater75/A (sky130_fd_sc_hd__clkbuf_2)
                  0.13    0.17    3.30 ^ repeater75/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net75 (net)
                  0.13    0.00    3.30 ^ repeater74/A (sky130_fd_sc_hd__clkbuf_2)
                  0.11    0.19    3.49 ^ repeater74/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net74 (net)
                  0.11    0.00    3.49 ^ repeater73/A (sky130_fd_sc_hd__clkbuf_1)
                  0.15    0.18    3.67 ^ repeater73/X (sky130_fd_sc_hd__clkbuf_1)
     3    0.01                           net73 (net)
                  0.15    0.00    3.67 ^ repeater72/A (sky130_fd_sc_hd__clkbuf_2)
                  0.12    0.21    3.88 ^ repeater72/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net72 (net)
                  0.12    0.00    3.88 ^ repeater71/A (sky130_fd_sc_hd__clkbuf_2)
                  0.12    0.20    4.07 ^ repeater71/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net71 (net)
                  0.12    0.00    4.07 ^ repeater70/A (sky130_fd_sc_hd__clkbuf_2)
                  0.13    0.20    4.28 ^ repeater70/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net70 (net)
                  0.13    0.00    4.28 ^ _0932_/B1 (sky130_fd_sc_hd__o31a_2)
                  0.14    0.25    4.53 ^ _0932_/X (sky130_fd_sc_hd__o31a_2)
     5    0.02                           tx.tx_crc.rst_n (net)
                  0.14    0.00    4.53 ^ repeater50/A (sky130_fd_sc_hd__clkbuf_2)
                  0.11    0.19    4.72 ^ repeater50/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net50 (net)
                  0.11    0.00    4.72 ^ repeater48/A (sky130_fd_sc_hd__clkbuf_2)
                  0.12    0.19    4.91 ^ repeater48/X (sky130_fd_sc_hd__clkbuf_2)
     5    0.02                           net48 (net)
                  0.12    0.00    4.91 ^ _1449_/SET_B (sky130_fd_sc_hd__dfstp_1)
                                  4.91   data arrival time

                         15.00   15.00   clock clk_48 (rise edge)
                          0.00   15.00   clock source latency
                  0.08    0.06   15.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.08    0.00   15.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.19   15.25 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00   15.25 ^ clkbuf_4_0_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.10    0.19   15.43 ^ clkbuf_4_0_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    19    0.05                           clknet_4_0_0_clk_48 (net)
                  0.10    0.00   15.44 ^ _1449_/CLK (sky130_fd_sc_hd__dfstp_1)
                         -0.25   15.19   clock uncertainty
                          0.00   15.19   clock reconvergence pessimism
                          0.15   15.33   library recovery time
                                 15.33   data required time
-----------------------------------------------------------------------------
                                 15.33   data required time
                                 -4.91   data arrival time
-----------------------------------------------------------------------------
                                 10.42   slack (MET)


Startpoint: _1515_ (rising edge-triggered flip-flop clocked by clk_48)
Endpoint: usb_rst (output port clocked by clk_48)
Path Group: clk_48
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock source latency
                  0.08    0.06    0.06 ^ clk_48 (in)
     1    0.02                           clk_48 (net)
                  0.08    0.00    0.06 ^ clkbuf_0_clk_48/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.21    0.27 ^ clkbuf_0_clk_48/X (sky130_fd_sc_hd__clkbuf_16)
    16    0.10                           clknet_0_clk_48 (net)
                  0.12    0.00    0.27 ^ clkbuf_4_15_0_clk_48/A (sky130_fd_sc_hd__clkbuf_8)
                  0.10    0.20    0.48 ^ clkbuf_4_15_0_clk_48/X (sky130_fd_sc_hd__clkbuf_8)
    18    0.05                           clknet_4_15_0_clk_48 (net)
                  0.10    0.00    0.48 ^ _1515_/CLK (sky130_fd_sc_hd__dfrtp_1)
                  0.07    0.43    0.91 v _1515_/Q (sky130_fd_sc_hd__dfrtp_1)
     3    0.01                           recv.reset_detect.cntr[0] (net)
                  0.07    0.00    0.91 v _0905_/A (sky130_fd_sc_hd__nor4_2)
                  0.37    0.43    1.34 ^ _0905_/Y (sky130_fd_sc_hd__nor4_2)
     4    0.01                           _0431_ (net)
                  0.37    0.00    1.34 ^ _0909_/A (sky130_fd_sc_hd__nand4_1)
                  0.15    0.19    1.52 v _0909_/Y (sky130_fd_sc_hd__nand4_1)
     2    0.01                           _0435_ (net)
                  0.15    0.00    1.52 v _0911_/A (sky130_fd_sc_hd__nor2_2)
                  0.21    0.26    1.78 ^ _0911_/Y (sky130_fd_sc_hd__nor2_2)
     4    0.02                           _0437_ (net)
                  0.21    0.00    1.79 ^ _0914_/B (sky130_fd_sc_hd__nand4b_4)
                  0.12    0.17    1.95 v _0914_/Y (sky130_fd_sc_hd__nand4b_4)
     5    0.02                           _0440_ (net)
                  0.12    0.00    1.95 v _0915_/A (sky130_fd_sc_hd__inv_2)
                  0.05    0.09    2.04 ^ _0915_/Y (sky130_fd_sc_hd__inv_2)
     2    0.01                           net43 (net)
                  0.05    0.00    2.04 ^ output43/A (sky130_fd_sc_hd__buf_2)
                  0.17    0.21    2.25 ^ output43/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           usb_rst (net)
                  0.17    0.00    2.25 ^ usb_rst (out)
                                  2.25   data arrival time

                         15.00   15.00   clock clk_48 (rise edge)
                          0.00   15.00   clock network delay (propagated)
                         -0.25   14.75   clock uncertainty
                          0.00   14.75   clock reconvergence pessimism
                         -3.00   11.75   output external delay
                                 11.75   data required time
-----------------------------------------------------------------------------
                                 11.75   data required time
                                 -2.25   data arrival time
-----------------------------------------------------------------------------
                                  9.50   slack (MET)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================
max fanout

Pin                                   Limit Fanout  Slack
---------------------------------------------------------
clkbuf_4_0_0_clk_48/X                     6     19    -13 (VIOLATED)
clkbuf_4_15_0_clk_48/X                    6     18    -12 (VIOLATED)
clkbuf_4_5_0_clk_48/X                     6     17    -11 (VIOLATED)
clkbuf_0_clk_48/X                         6     16    -10 (VIOLATED)
clkbuf_4_10_0_clk_48/X                    6     16    -10 (VIOLATED)
clkbuf_4_2_0_clk_48/X                     6     13     -7 (VIOLATED)
clkbuf_4_13_0_clk_48/X                    6     12     -6 (VIOLATED)
clkbuf_4_14_0_clk_48/X                    6     12     -6 (VIOLATED)
clkbuf_4_1_0_clk_48/X                     6     12     -6 (VIOLATED)
clkbuf_4_4_0_clk_48/X                     6     12     -6 (VIOLATED)
clkbuf_4_7_0_clk_48/X                     6     12     -6 (VIOLATED)
clkbuf_4_8_0_clk_48/X                     6     11     -5 (VIOLATED)
clkbuf_4_11_0_clk_48/X                    6      9     -3 (VIOLATED)
clkbuf_4_6_0_clk_48/X                     6      9     -3 (VIOLATED)
clkbuf_4_12_0_clk_48/X                    6      8     -2 (VIOLATED)
clkbuf_4_3_0_clk_48/X                     6      8     -2 (VIOLATED)


===========================================================================
max slew violation count 0
max fanout violation count 16
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack 9.50

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack 0.09
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock clk_48
Latency      CRPR       Skew
_1478_/CLK ^
   0.48
_1433_/CLK ^
   0.39     -0.03       0.06

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             5.52e-04   2.36e-05   1.62e-09   5.76e-04  58.3%
Combinational          1.91e-04   2.22e-04   3.17e-09   4.12e-04  41.7%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  7.43e-04   2.45e-04   4.79e-09   9.88e-04 100.0%
                          75.2%      24.8%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 11622 u^2 43% utilization.
area_report_end
