OpenROAD 0b8b7ae255f8fbbbefa57d443949b84e73eed757 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/usb/runs/prueba7/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/usb/runs/prueba7/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/usb/runs/prueba7/tmp/placement/9-global.def
[INFO ODB-0128] Design: usb
[INFO ODB-0130]     Created 46 pins.
[INFO ODB-0131]     Created 1406 components and 8210 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 4880 connections.
[INFO ODB-0133]     Created 937 nets and 3330 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/usb/runs/prueba7/tmp/placement/9-global.def
###############################################################################
# Created by write_sdc
# Fri Apr 21 23:09:15 2023
###############################################################################
current_design usb
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_48 -period 15.0000 [get_ports {clk_48}]
set_clock_transition 0.1500 [get_clocks {clk_48}]
set_clock_uncertainty 0.2500 clk_48
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[2]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[3]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[4]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[5]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[6]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in[7]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_in_valid}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_toggle}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {handshake[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {handshake[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {rst_n}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {rx_j}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {rx_se0}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[2]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[3]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[4]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[5]}]
set_input_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_address[6]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[0]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[1]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[2]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[3]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[4]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[5]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[6]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_out[7]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {data_strobe}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {direction_in}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[0]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[1]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[2]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {endpoint[3]}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {setup}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {success}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {transaction_active}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {tx_en}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {tx_j}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {tx_se0}]
set_output_delay 3.0000 -clock [get_clocks {clk_48}] -add_delay [get_ports {usb_rst}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {data_strobe}]
set_load -pin_load 0.0334 [get_ports {direction_in}]
set_load -pin_load 0.0334 [get_ports {setup}]
set_load -pin_load 0.0334 [get_ports {success}]
set_load -pin_load 0.0334 [get_ports {transaction_active}]
set_load -pin_load 0.0334 [get_ports {tx_en}]
set_load -pin_load 0.0334 [get_ports {tx_j}]
set_load -pin_load 0.0334 [get_ports {tx_se0}]
set_load -pin_load 0.0334 [get_ports {usb_rst}]
set_load -pin_load 0.0334 [get_ports {data_out[7]}]
set_load -pin_load 0.0334 [get_ports {data_out[6]}]
set_load -pin_load 0.0334 [get_ports {data_out[5]}]
set_load -pin_load 0.0334 [get_ports {data_out[4]}]
set_load -pin_load 0.0334 [get_ports {data_out[3]}]
set_load -pin_load 0.0334 [get_ports {data_out[2]}]
set_load -pin_load 0.0334 [get_ports {data_out[1]}]
set_load -pin_load 0.0334 [get_ports {data_out[0]}]
set_load -pin_load 0.0334 [get_ports {endpoint[3]}]
set_load -pin_load 0.0334 [get_ports {endpoint[2]}]
set_load -pin_load 0.0334 [get_ports {endpoint[1]}]
set_load -pin_load 0.0334 [get_ports {endpoint[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_48}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_toggle}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_j}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_se0}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {handshake[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {handshake[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_address[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 6.0000 [current_design]
[INFO]: Setting RC values...
[INFO RSZ-0027] Inserted 22 input buffers.
[INFO RSZ-0028] Inserted 21 output buffers.
[INFO RSZ-0058] Using max wire length 3048um.
[INFO RSZ-0035] Found 4 fanout violations.
[INFO RSZ-0038] Inserted 32 buffers in 4 nets.
[INFO RSZ-0039] Resized 890 instances.
Placement Analysis
---------------------------------
total displacement       3849.1 u
average displacement        2.6 u
max displacement           14.5 u
original HPWL           20651.7 u
legalized HPWL          24802.4 u
delta HPWL                   20 %

[INFO DPL-0020] Mirrored 377 instances
[INFO DPL-0021] HPWL before           24802.4 u
[INFO DPL-0022] HPWL after            24135.0 u
[INFO DPL-0023] HPWL delta               -2.7 %
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: _1601_ (rising edge-triggered flip-flop clocked by clk_48)
Endpoint: _1458_ (removal check against rising-edge clock clk_48)
Path Group: **async_default**
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _1601_/CLK (sky130_fd_sc_hd__dfrtp_2)
                  0.12    0.42    0.42 ^ _1601_/Q (sky130_fd_sc_hd__dfrtp_2)
     6    0.02                           tx.state[0] (net)
                  0.12    0.00    0.42 ^ _0870_/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.19    0.20    0.62 ^ _0870_/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     6    0.02                           _0400_ (net)
                  0.19    0.00    0.62 ^ _0930_/A (sky130_fd_sc_hd__clkbuf_2)
                  0.11    0.19    0.81 ^ _0930_/X (sky130_fd_sc_hd__clkbuf_2)
     6    0.02                           _0452_ (net)
                  0.11    0.00    0.81 ^ _0932_/A2 (sky130_fd_sc_hd__o31a_2)
                  0.14    0.22    1.03 ^ _0932_/X (sky130_fd_sc_hd__o31a_2)
     5    0.02                           tx.tx_crc.rst_n (net)
                  0.14    0.00    1.03 ^ _1458_/SET_B (sky130_fd_sc_hd__dfstp_1)
                                  1.03   data arrival time

                  0.15    0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _1458_/CLK (sky130_fd_sc_hd__dfstp_1)
                          0.18    0.43   library removal time
                                  0.43   data required time
-----------------------------------------------------------------------------
                                  0.43   data required time
                                 -1.03   data arrival time
-----------------------------------------------------------------------------
                                  0.61   slack (MET)


Startpoint: _1592_ (rising edge-triggered flip-flop clocked by clk_48)
Endpoint: _1593_ (rising edge-triggered flip-flop clocked by clk_48)
Path Group: clk_48
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _1592_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.04    0.32    0.32 v _1592_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.01                           recv.se0_filter.r[2] (net)
                  0.04    0.00    0.32 v _1593_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.32   data arrival time

                  0.15    0.00    0.00   clock clk_48 (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _1593_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.03    0.22   library hold time
                                  0.22   data required time
-----------------------------------------------------------------------------
                                  0.22   data required time
                                 -0.32   data arrival time
-----------------------------------------------------------------------------
                                  0.10   slack (MET)


min_report_end
Error: sta.tcl, 73 couldn't open "/home/licit/OpenLane/tipos_ff.txt": no such file or directory
